from pymongo import MongoClient

conn = MongoClient('localhost', 27017)
db = conn.mydb  # 连接mydb数据库，没有则自动创建
my_set = db.test_set  # 使用test_set集合，没有则自动创建

my_set.insert({"企业年报":[
    {
        "企业基本信息": {
            "统一社会信用代码": "91110000100018988F",
            "企业名称": "中国民生银行股份有限公司",
            "企业联系电话": "010-58560666",
            "邮政编码": "100031",
            "企业经营状态": "开业",
            "从业人数": "56168人",
            "电子邮箱": "cmbc@cmbc.com.cn",
            "是否有网站或网店": "是",
            "企业通信地址": "中国北京市西城区复兴门内大街2号",
            "企业是否有投资信息或购买其他公司股权": "有"
        },
        "网站或网店信息": [
            {
                "类型": "网站",
                "名称": "中国民生银行股份有限公司",
                "网址": "www.cmbc.com.cn"
            }
        ],
        "股东及出资信息": [
            {
                "股东": "境外上市外资股",
                "认缴出资额(万元)": "577798.284",
                "认缴出资时间": "2012-04-02",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "577798.284",
                "实缴出资时间": "2012-04-02",
                "实缴出资方式": "货币"
            },
            {
                "股东": "人民币普通股（不含发起人股）",
                "认缴出资额(万元)": "2120735.4011",
                "认缴出资时间": "2012-04-02",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "2120735.4011",
                "实缴出资时间": "2012-04-02",
                "实缴出资方式": "货币"
            },
            {
                "股东": "发起人股",
                "认缴出资额(万元)": "138024.8376",
                "认缴出资时间": "1996-02-07",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "138024.8376",
                "实缴出资时间": "1996-02-07",
                "实缴出资方式": "货币"
            }
        ],
        "企业资产状况信息": {
            "资产总额": "企业选择不公示",
            "所有者权益合计": "企业选择不公示",
            "销售总额": "企业选择不公示",
            "利润总额": "企业选择不公示",
            "营业总收入中主营业务收入": "企业选择不公示",
            "净利润": "企业选择不公示",
            "纳税总额": "企业选择不公示",
            "负债总额": "企业选择不公示"
        },
        "对外投资信息": [
            {
                "统一社会信用代码/统一信用代码": "91350600587526668Q",
                "对外投资企业名称": "漳浦民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "9133100005133211XY",
                "对外投资企业名称": "浙江天台民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91330200681092931N",
                "对外投资企业名称": "慈溪民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91420800571508270N",
                "对外投资企业名称": "钟祥民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91341800595716672W",
                "对外投资企业名称": "宁国民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "9137060057391917X4",
                "对外投资企业名称": "蓬莱民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91540402064673394E",
                "对外投资企业名称": "林芝民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91420500568322344E",
                "对外投资企业名称": "宜都民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "9131000057084896XK",
                "对外投资企业名称": "上海嘉定民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91220501559773629A",
                "对外投资企业名称": "梅河口民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "915101826796582036",
                "对外投资企业名称": "彭州民生村镇银行有限责任公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91320500582299742D",
                "对外投资企业名称": "太仓民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91530800594552776J",
                "对外投资企业名称": "普洱民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "914403007178837879",
                "对外投资企业名称": "民生加银基金公司"
            },
            {
                "统一社会信用代码/统一信用代码": "913100006988128867",
                "对外投资企业名称": "上海松江民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "916108005933273580",
                "对外投资企业名称": "榆林榆阳民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91341100054470809N",
                "对外投资企业名称": "天长民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91350500572999884R",
                "对外投资企业名称": "安溪民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "913209005794860882",
                "对外投资企业名称": "阜宁民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "915002235616065551",
                "对外投资企业名称": "潼南民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91610625593316632A",
                "对外投资企业名称": "志丹民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "913417000501626735",
                "对外投资企业名称": "池州贵池民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91530500056960588X",
                "对外投资企业名称": "腾冲民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "914201155623117167",
                "对外投资企业名称": "武汉江夏民生村镇银行"
            },
            {
                "统一社会信用代码/统一信用代码": "915120005607454493",
                "对外投资企业名称": "资阳民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91130500586935320L",
                "对外投资企业名称": "宁晋民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91532800592042924A",
                "对外投资企业名称": "景洪民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "91500222561606379M",
                "对外投资企业名称": "綦江民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "914107005672660107",
                "对外投资企业名称": "长垣民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "913502000728104911",
                "对外投资企业名称": "厦门翔安民生村镇银行股份有限公司"
            },
            {
                "统一社会信用代码/统一信用代码": "911201186737078795",
                "对外投资企业名称": "民生金融租赁公司"
            }
        ],
        "年度": "2016详情"
    },
    {
        "企业基本信息": {
            "统一社会信用代码": "91110000100018988F",
            "企业名称": "中国民生银行股份有限公司",
            "企业联系电话": "010-68946790",
            "邮政编码": "100031",
            "企业经营状态": "开业",
            "从业人数": "57228人",
            "电子邮箱": "cmbc@cmbc.com.cn",
            "是否有网站或网店": "是",
            "企业通信地址": "中国北京市西城区复兴门内大街2号",
            "企业是否有投资信息或购买其他公司股权": "有"
        },
        "网站或网店信息": [
            {
                "类型": "网站",
                "名称": "中国民生银行股份有限公司",
                "网址": "www.cmbc.com.cn"
            }
        ],
        "股东及出资信息": [
            {
                "股东": "境外上市外资股",
                "认缴出资额(万元)": "577798.284",
                "认缴出资时间": "2012-04-02",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "577798.284",
                "实缴出资时间": "2012-04-02",
                "实缴出资方式": "货币"
            },
            {
                "股东": "人们币普通股（不含发起人股）",
                "认缴出资额(万元)": "2120735.4011",
                "认缴出资时间": "2012-04-02",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "2120735.4011",
                "实缴出资时间": "2012-04-02",
                "实缴出资方式": "货币"
            },
            {
                "股东": "发起人股",
                "认缴出资额(万元)": "138024.8376",
                "认缴出资时间": "1996-02-07",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "138024.8376",
                "实缴出资时间": "1996-02-07",
                "实缴出资方式": "货币"
            }
        ],
        "企业资产状况信息": {
            "资产总额": "企业选择不公示",
            "所有者权益合计": "企业选择不公示",
            "销售总额": "企业选择不公示",
            "利润总额": "企业选择不公示",
            "营业总收入中主营业务收入": "企业选择不公示",
            "净利润": "企业选择不公示",
            "纳税总额": "企业选择不公示",
            "负债总额": "企业选择不公示"
        },
        "对外投资信息": [
            {
                "统一社会信用代码/统一信用代码": "91320500582299742D",
                "对外投资企业名称": "太仓民生村镇银行"
            },
            {
                "统一社会信用代码/统一信用代码": "91350600587526668Q",
                "对外投资企业名称": "漳浦民生村镇银行"
            },
            {
                "统一社会信用代码/统一信用代码": "91530800594552776J",
                "对外投资企业名称": "普洱民生村镇银行"
            },
            {
                "统一社会信用代码/统一信用代码": "91341800595716672W（1-1）",
                "对外投资企业名称": "宁国民生村镇银行"
            },
            {
                "统一社会信用代码/统一信用代码": "9133100005133211XY",
                "对外投资企业名称": "天台民生村镇银行"
            }
        ],
        "年度": "2015详情"
    },
    {
        "企业基本信息": {
            "统一社会信用代码": "100000000018983",
            "企业名称": "中国民生银行股份有限公司",
            "企业联系电话": "86-10-68946790",
            "邮政编码": "100031",
            "企业经营状态": "开业",
            "从业人数": "57406人",
            "电子邮箱": "cmbc@cmbc.com.cn",
            "是否有网站或网店": "是",
            "企业通信地址": "中国北京市西城区复兴门内大街2号",
            "企业是否有投资信息或购买其他公司股权": "无"
        },
        "网站或网店信息": [
            {
                "类型": "网站",
                "名称": "中国民生银行",
                "网址": "www.cmbc.com.cn"
            }
        ],
        "股东及出资信息": [
            {
                "股东": "境外上市外资股",
                "认缴出资额(万元)": "577798.284",
                "认缴出资时间": "2012-04-02",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "577798.284",
                "实缴出资时间": "2012-04-02",
                "实缴出资方式": "货币"
            },
            {
                "股东": "人民币普通股（不含发起人股）",
                "认缴出资额(万元)": "2120735.4011",
                "认缴出资时间": "2012-04-02",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "2120735.4011",
                "实缴出资时间": "2012-04-02",
                "实缴出资方式": "货币"
            },
            {
                "股东": "发起人股",
                "认缴出资额(万元)": "138024.8376",
                "认缴出资时间": "1996-02-07",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "138024.8376",
                "实缴出资时间": "1996-02-07",
                "实缴出资方式": "货币"
            }
        ],
        "企业资产状况信息": {
            "资产总额": "企业选择不公示",
            "所有者权益合计": "企业选择不公示",
            "销售总额": "企业选择不公示",
            "利润总额": "企业选择不公示",
            "营业总收入中主营业务收入": "企业选择不公示",
            "净利润": "企业选择不公示",
            "纳税总额": "企业选择不公示",
            "负债总额": "企业选择不公示"
        },
        "年度": "2014详情"
    },
    {
        "企业基本信息": {
            "统一社会信用代码": "100000000018983",
            "企业名称": "中国民生银行股份有限公司",
            "企业联系电话": "86-10-68946790",
            "邮政编码": "100031",
            "企业经营状态": "开业",
            "从业人数": "53064人",
            "电子邮箱": "cmbc@cmbc.com.cn",
            "是否有网站或网店": "是",
            "企业通信地址": "中国北京市西城区复兴门内大街2号",
            "企业是否有投资信息或购买其他公司股权": "无"
        },
        "网站或网店信息": [
            {
                "类型": "网站",
                "名称": "中国民生银行",
                "网址": "www.cmbc.com.cn"
            }
        ],
        "股东及出资信息": [
            {
                "股东": "境外上市外资股",
                "认缴出资额(万元)": "577798.284",
                "认缴出资时间": "2012-04-02",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "577798.284",
                "实缴出资时间": "2012-04-02",
                "实缴出资方式": "货币"
            },
            {
                "股东": "人民币普通股（不含发起人股）",
                "认缴出资额(万元)": "2120735.4011",
                "认缴出资时间": "2012-04-02",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "2120735.4011",
                "实缴出资时间": "2012-04-02",
                "实缴出资方式": "货币"
            },
            {
                "股东": "发起人股",
                "认缴出资额(万元)": "138024.8376",
                "认缴出资时间": "1996-02-07",
                "认缴出资方式": "货币",
                "实缴出资额(万元)": "138024.8376",
                "实缴出资时间": "1996-02-07",
                "实缴出资方式": "货币"
            }
        ],
        "企业资产状况信息": {
            "资产总额": "企业选择不公示",
            "所有者权益合计": "企业选择不公示",
            "销售总额": "企业选择不公示",
            "利润总额": "企业选择不公示",
            "营业总收入中主营业务收入": "企业选择不公示",
            "净利润": "企业选择不公示",
            "纳税总额": "企业选择不公示",
            "负债总额": "企业选择不公示"
        },
        "年度": "2013详情"
    }
]})